/* Localizable strings not stored in nib files and not stored in application resources, */
/* the strings below can be accessed using the GetBundleLocalizedString() macro, those */
/* stored in application resources must be accessed using GetLocalizedString() instead. */

// Overview key strings
"DHCP Service is:" = "DHCP Service is:";
"Start Time:" = "Start Time:";
"Static Maps:" = "Static Maps:";
"%ld active %@, %ld expired" = "%ld active %@, %ld expired";
"%ld active %@" = "%ld active %@";
"lease" = "lease";
"leases" = "leases";
"Current DHCP Clients:" = "Current DHCP Clients:";
"Last Client Database Update:" = "Last Client Database Update:";

// Search field placeholder text strings
"Computer Name" = "Computer Name";
"MAC Address" = "MAC Address";
"IP Address" = "IP Address";
"Client ID" = "Client ID";
"Subnet Name" = "Subnet Name";

"%d clients" = "%d clients";

"%d interface" = "%d interface";
"%d interfaces" = "%d interfaces";
"%d address" = "%d address";
"%d addresses" = "%d addresses";

"Create Static Map..." = "Create Static Map…";
"Create Static Maps..." = "Create Static Maps…";
"Create static maps for the selected clients?" = "Create static maps for the selected clients?";
"Create static map for the selected client?" = "Create static map for the selected client?";
"Create Maps" = "Create Maps";
"Create Map" = "Create Map";
"Each static map will be generated with the client's current network configuration." = "Each static map will be generated with the client's current network configuration.";
"The static map will be generated with the client's current network configuration." = "The static map will be generated with the client's current network configuration.";

"Delete Leases..." = "Delete Leases…";
"Delete Lease..." = "Delete Lease…";
"Delete selected clients' leases?" = "Delete selected clients' leases?";
"Delete selected client's lease?" = "Delete selected client's lease?";
"Delete Leases" = "Delete Leases";
"Delete Lease" = "Delete Lease";
"The leases will be deleted immediately." = "The leases will be deleted immediately.";
"The lease will be deleted immediately." = "The lease will be deleted immediately.";

"Expired" = "Expired";

"RUNNING" = "Running";
"STOPPED" = "Stopped";
"STARTING" = "Starting up";
"STOPPING" = "Shutting down";
"PAUSED" = "Paused";
"UNKNOWN" = "Unknown";
"N/A" = "Not available";

"LEASE_HOURS"="hours";
"LEASE_DAYS"="days";
"LEASE_WEEKS"="weeks";
"LEASE_MONTHS"="months";

"SUBNET_LIST_DELETING_SUBNET_CONFIRM"="You are deleting one or more DHCP subnets. Are you sure you want to delete?";

"Search Domains:" = "Search Domains:";
"Default Search Domain:" = "Default Search Domain:";

"SUBNET_MASK"="Subnet Mask";
"SUBNET_NAME"="Subnet Name";
"STARTING_ADDRESS"="Starting Address";
"ENDING_ADDRESS"="Ending Address";
	
"100" = "check the log for details"; /* General error message */
"200" = "check the log for details"; /* Read Settings message */
"300" = "check the log for details"; /* Write Settings message */
"400" = "Some saved settings are invalid. Check the log for details."; /* Read Settings message */

SUBNET_GENERAL_INVALID_START_RANGE = "401";
"401" = "There is an invalid IP address in the Start field for the subnet range in the General tab.";

SUBNET_GENERAL_INVALID_END_RANGE = "402";
"402" = "There is an invalid IP address in the End field for the subnet range in the General tab.";
	
SUBNET_GENERAL_INVALID_ROUTER_ADDRESS = "403";
"403" = "There is an invalid IP address in the Router field in the General tab.";
	
SUBNET_GENERAL_INVALID_SUBNET_MASK = "404";
"404" = "There is an invalid mask in the Subnet Mask field in the General tab.";

SUBNET_GENERAL_INVALID_IP_RANGE_START = "405";
"405" = "The Start IP address in the General tab cannot be greater than the End IP address.";
	
SUBNET_GENERAL_INVALID_IP_RANGE_BAD_SUBNET = "406";
"406" = "The IP Start and End addresses in the General tab are not in the same subnet. Check the Start, End, and Subnet Mask fields.";
	
SUBNET_GENERAL_INVALID_IP_RANGE_ROUTER_ADDRESS ="407";
"407" = "The Router address in the General tab is not in the same subnet as the Start and End addresses.  Check the Start, End, Mask and Router fields.";

SUBNET_GENERAL_RANGE_OVERLAP ="408";
"408" = "The IP address range in the General tab overlaps with the range of another subnet. Change the subnet range(s) to eliminate the overlap.";

DNS_TOO_MANY_SERVERS ="409";
"409" = "The Name Servers list field in the DNS tab cannot contain more than 3 IP addresses.";
	
DNS_INVALID_DOMAIN_NAME_TOO_FEW_SEGMENTS ="410";
"410" = "The domain name in the DNS tab must contain at least two segments.";

DNS_INVALID_IP = "411";
"411" = "There is an invalid IP address in the DNS Servers list in the DNS tab.";
	
LDAP_INVALID_SERVER = "412";
"412" = "The Server Name field in the LDAP tab is invalid.";

LDAP_INVALID_BASE = "413";
"413" = "The Search Base field in the LDAP tab is invalid.";

LDAP_INVALID_PORT = "414";
"414" = "The Port field in the LDAP tab is invalid.";

WINS_INVALID_PRIMARY_IP = "415";
"415" = "The primary server address in the WINS tab is invalid. (example: 192.145.22.40)";

WINS_INVALID_SECONDARY_IP = "416";
"416" = "The secondary server address in the WINS tab is invalid. (example: 192.145.22.40)";

WINS_INVALID_NBDD_IP = "417";
"417" = "The NBDD server address in the WINS tab is invalid. (example: 192.145.22.40)";

WINS_INVALID_SCOPE_TOO_FEW_SEGMENTS = "418";
"418" = "The scope ID in the WINS tab is invalid. (example: SCOPE.COM)";

kEmptyFieldSubnetName = "419";
"419" = "A value for the Subnet name field in the General tab is required. Please enter data into the field.";

kEmptyFieldStartingIPAddress = "420";
"420" = "A value for the Start IP address field in the General tab is required. Please enter data into the field.";

kEmptyFieldEndingIPAddress = "421";
"421" = "A value for the End IP address field in the General tab is required. Please enter data into the field.";

kEmptyFieldSubnetMask = "422";
"422" = "A value for the Subnet Mask field in the General tab is required. Please enter data into the field.";

kEmptyFieldRouter = "423";
"423" = "A value for the Router field in the General tab is required. Please enter data into the field.";

kEmptyFieldLeaseTime = "424";
"424" = "A value for the lease time in the General tab is required. Please enter data into the field.";

kEmptyFieldDefaultDomain = "425";
"425" = "A value for the default domain in the DNS tab is required. Please enter data into the field.";

kEmptyFieldNameServers = "426";
"426" = "A value for the name servers in the DNS tab is required. Please enter data into the field.";

kEmptyFieldServerName = "427";
"427" = "A value for the server name in the LDAP tab is required. Please enter data into the field.";

kEmptyFieldSearchBase = "428";
"428" = "A value for the search base in the LDAP tab is required. Please enter data into the field.";

kEmptyFieldPort = "429";
"429" = "A value for the port in the LDAP tab is required. Please enter data into the field.";

kEmptyFieldPrimaryServer = "430";
"430" = "A value for the primary server in the WINS tab is required. Please enter data into the field.";

kEmptyFieldSecondaryServer = "431";
"431" = "A value for the secondary server in the WINS tab is required. Please enter data into the field.";

kEmptyFieldNBDDServer = "432";
"432" = "A value for the NBDD server in the WINS tab is required. Please enter data into the field.";

kEmptyFieldNETBIOSScopeID = "433";
"433" = "A value for the scope ID in the WINS tab is required. Please enter data into the field.";

kEmptyFieldNodeType = "434";
"434" = "A value for the node type in the WINS tab is required. Please enter data into the field.";

"You can only specify one default search domain" = "You can only specify one default search domain";

"NOT_SET"="Not Set";
"BROADCAST_B_NODE"="Broadcast (b-node)";
"PEER_P_NODE"="Peer (p-node)";
"MIXED_M_NODE"="Mixed (m-node)";
"HYBRID_H_NODE"="Hybrid (h-node)";

"kCannotAcceptSettingsAlertTtl" = "Cannot accept settings";
"kCannotSaveSettingsAlertTtl" = "Cannot save settings";
"kSaveSettingsAlertTtl" = "Are you sure you want to save settings?";

"kDeleteSubnetsAlertTtl" = "Are you sure you want to delete the selected subnets?";

"kOKButton" = "OK";
"kSaveButton" = "Save";

"kCancelButton" = "Cancel";

"kDeleteButton" = "Delete";

"LOW" = "Low (errors only)";
"MEDIUM" = "Medium (errors and warnings)";
"HIGH" = "High (all events)";

"DHCP Log" = "DHCP Log";
